app/views/counties/_form.html.erb

SELECT `counties`.* FROM `counties` WHERE `counties`.`id` = 1 LIMIT 1
---
    <div id="error_explanation">
      <h2><%= pluralize(@county.errors.count, "error") %> prohibited this county from being saved:</h2>