app/controllers/addresses_controller.rb

  def index
    @addresses = Address.all
---
SELECT `addresses`.* FROM `addresses`

  def show
    @address = Address.find(params[:id])
---
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 1 LIMIT 1

  def create
    @address = Address.new(params[:address])

    respond_to do |format|
      if @address.save
---
INSERT INTO `addresses` (`StreetName`, `StreetNumber`, `agency_id`, `city`, `contact_id`, `created_at`, `state`, `updated_at`, `zip`) VALUES ('morse avenue', '1063', NULL, 'sunnyvale', NULL, '2012-08-24 18:57:07', 'california', '2012-08-24 18:57:07', 94089)