app/controllers/agencies_controller.rb

SELECT `agencies`.* FROM `agencies`
---
  def index
    @agencies = Agency.all

SELECT `agencies`.* FROM `agencies` WHERE `agencies`.`id` = 1 LIMIT 1
---
  def show
    @agency = Agency.find(params[:id])

SELECT `agencies`.* FROM `agencies` WHERE `agencies`.`id` = 1 LIMIT 1
---
  def edit
    @agency = Agency.find(params[:id])

INSERT INTO `agencies` (`AgencyName`, `county_id`, `created_at`, `email`, `fax`, `phone`, `updated_at`) VALUES ('', NULL, '2012-08-22 22:24:03', '', NULL, NULL, '2012-08-22 22:24:03')
---
  def create
    @agency = Agency.new(params[:agency])

    respond_to do |format|
      if @agency.save

SELECT `agencies`.* FROM `agencies` WHERE `agencies`.`id` = 1 LIMIT 1
DELETE FROM `agencies` WHERE `agencies`.`id` = 1
---
  def destroy
    @agency = Agency.find(params[:id])
    @agency.destroy