app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
  def show
    @contact = Contact.find(params[:id])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO `contacts` (`Email`, `FirstName`, `LastName`, `agency_id`, `created_at`, `phone`, `updated_at`) VALUES ('nakkap3@yahoo.com', 'pranathi', 'nakka', NULL, '2012-08-24 18:49:35', 4085058119, '2012-08-24 18:49:35')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
  def update
    @contact = Contact.find(params[:id])

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 14 LIMIT 1
DELETE FROM `contacts` WHERE `contacts`.`id` = 14
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy