app/controllers/counties_controller.rb

SELECT `counties`.* FROM `counties`
---
  def index
    @counties = County.all

SELECT `counties`.* FROM `counties` WHERE `counties`.`id` = 1 LIMIT 1
---
  def show
    @county = County.find(params[:id])

SELECT `counties`.* FROM `counties` WHERE `counties`.`id` = 1 LIMIT 1
---
  def edit
    @county = County.find(params[:id])

INSERT INTO `counties` (`CountyName`, `created_at`, `updated_at`) VALUES ('new', '2012-08-24 18:47:02', '2012-08-24 18:47:02')
---
  def create
    @county = County.new(params[:county])

    respond_to do |format|
      if @county.save