app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT `departments`.* FROM `departments`

  def show
    @department = Department.find(params[:id])
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1

  def create
    @department = Department.new(params[:department])

    respond_to do |format|
      if @department.save
---
INSERT INTO `departments` (`Name`, `agency_id`, `created_at`, `updated_at`) VALUES ('Administrative and technology services section', NULL, '2012-08-24 18:59:10', '2012-08-24 18:59:10')