app/controllers/enrichment_acts_controller.rb

  def index
    @enrichment_acts = EnrichmentAct.all
---
SELECT `enrichment_acts`.* FROM `enrichment_acts`

  def show
    @enrichment_act = EnrichmentAct.find(params[:id])
---
SELECT `enrichment_acts`.* FROM `enrichment_acts` WHERE `enrichment_acts`.`id` = 1 LIMIT 1

  def create
    @enrichment_act = EnrichmentAct.new(params[:enrichment_act])

    respond_to do |format|
      if @enrichment_act.save
---
INSERT INTO `enrichment_acts` (`created_at`, `desc`, `name`, `updated_at`) VALUES ('2012-08-24 19:00:16', 'human readable code', 'Coding', '2012-08-24 19:00:16')