app/controllers/intern_requests_controller.rb

SELECT `intern_requests`.* FROM `intern_requests`
---
  def index
    @intern_requests = InternRequest.all

SELECT `intern_requests`.* FROM `intern_requests` WHERE `intern_requests`.`id` = 1 LIMIT 1
---
  def show
    @intern_request = InternRequest.find(params[:id])

INSERT INTO `intern_requests` (`EndDate`, `EndHour`, `EveningMeetingsPercent`, `InternProjectDesc`, `InternProvisionEmail`, `InternProvisionPhone`, `OfficeDutiesPercent`, `OutFieldWorkPercent`, `StartDate`, `StartHour`, `WeekendWorkPercent`, `address_id`, `agency_id`, `authorized_person_id`, `contact_id`, `created_at`, `department_id`, `internship_location_id`, `interviewer_id`, `job_id`, `mentor_id`, `status_id`, `updated_at`) VALUES ('2012-08-24 01:12:00', '2012-08-24 17:00:00', 10, 'a project to put MTC\'s HS internship request forms online.\r\n', 1, 1, 50, 50, '2012-08-24 01:09:00', '2012-08-24 08:00:00', 0, NULL, NULL, NULL, NULL, '2012-08-24 19:04:00', NULL, NULL, NULL, NULL, NULL, NULL, '2012-08-24 19:04:00')
---
  def create
    @intern_request = InternRequest.new(params[:intern_request])

    respond_to do |format|
      if @intern_request.save