app/controllers/internship_locations_controller.rb

SELECT `internship_locations`.* FROM `internship_locations`
---
  def index
    @internship_locations = InternshipLocation.all

SELECT `internship_locations`.* FROM `internship_locations` WHERE `internship_locations`.`id` = 1 LIMIT 1
---
  def show
    @internship_location = InternshipLocation.find(params[:id])

INSERT INTO `internship_locations` (`agency_id`, `county_id`, `created_at`, `phone`, `updated_at`) VALUES (NULL, NULL, '2012-08-24 19:07:49', 4085058119, '2012-08-24 19:07:49')
---
  def create
    @internship_location = InternshipLocation.new(params[:internship_location])

    respond_to do |format|
      if @internship_location.save