app/controllers/intern_questions_controller.rb

SELECT `intern_questions`.* FROM `intern_questions`
---
  def index
    @intern_questions = InternQuestion.all

SELECT `intern_questions`.* FROM `intern_questions` WHERE `intern_questions`.`id` = 1 LIMIT 1
---
  def show
    @intern_question = InternQuestion.find(params[:id])

INSERT INTO `intern_questions` (`created_at`, `name`, `updated_at`, `value`) VALUES ('2012-08-24 19:06:05', 'have you ever been employed by bart?', '2012-08-24 19:06:05', 1)
---
  def create
    @intern_question = InternQuestion.new(params[:intern_question])

    respond_to do |format|
      if @intern_question.save