app/controllers/interviewers_controller.rb

  def index
    @interviewers = Interviewer.all
---
SELECT `interviewers`.* FROM `interviewers`

  def show
    @interviewer = Interviewer.find(params[:id])
---
SELECT `interviewers`.* FROM `interviewers` WHERE `interviewers`.`id` = 1 LIMIT 1

  def edit
    @interviewer = Interviewer.find(params[:id])
---
SELECT `interviewers`.* FROM `interviewers` WHERE `interviewers`.`id` = 1 LIMIT 1

  def create
    @interviewer = Interviewer.new(params[:interviewer])

    respond_to do |format|
      if @interviewer.save
---
INSERT INTO `interviewers` (`FirstName`, `LastName`, `agency_id`, `created_at`, `email`, `phone`, `title`, `updated_at`) VALUES ('pranathi', 'nakka', NULL, '2012-08-24 19:09:40', 'nakkap3@mtc.ca.gov', 4085058119, 'intern', '2012-08-24 19:09:40')