app/controllers/login_users_controller.rb

SELECT `login_users`.* FROM `login_users`
---
  def index
    @login_users = LoginUser.all

SELECT `login_users`.* FROM `login_users` WHERE `login_users`.`id` = 1 LIMIT 1
---
  def show
    @login_user = LoginUser.find(params[:id])

INSERT INTO `login_users` (`Email`, `FirstName`, `LastName`, `Login`, `Password`, `created_at`, `updated_at`) VALUES ('pnakka@mtc.ca.gov', NULL, NULL, 'pnakka', 'nakka123', '2012-08-24 19:14:23', '2012-08-24 19:14:23')
---
  def create
    @login_user = LoginUser.new(params[:login_user])

    respond_to do |format|
      if @login_user.save