app/controllers/mentors_controller.rb

  def index
    @mentors = Mentor.all
---
SELECT `mentors`.* FROM `mentors`

  def show
    @mentor = Mentor.find(params[:id])
---
SELECT `mentors`.* FROM `mentors` WHERE `mentors`.`id` = 1 LIMIT 1

  def create
    @mentor = Mentor.new(params[:mentor])

    respond_to do |format|
      if @mentor.save
---
INSERT INTO `mentors` (`FirstName`, `LastName`, `agency_id`, `created_at`, `department`, `email`, `phone`, `title`, `updated_at`) VALUES ('yong', 'lee', NULL, '2012-08-24 19:10:45', 'IT department', 'ylee@mtc.ca.gov', 4084088119, 'systems admin', '2012-08-24 19:10:45')