app/controllers/statuses_controller.rb

SELECT `statuses`.* FROM `statuses`
---
  def index
    @statuses = Status.all

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1 LIMIT 1
---
  def show
    @status = Status.find(params[:id])

SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1 LIMIT 1
---
  def edit
    @status = Status.find(params[:id])

INSERT INTO `statuses` (`StatusDescription`, `created_at`, `updated_at`) VALUES ('InProcess', '2012-08-24 18:45:48', '2012-08-24 18:45:48')
---
  def create
    @status = Status.new(params[:status])

    respond_to do |format|
      if @status.save